#10 ЛР
# Даны два списка чисел.
# Найдите всечисла, которые входят как в первый, так и во второй список и выведите их в порядке возрастания.
# И даже эту задачу на Питоне можно решить в одну строчку.
#Входные данные
#1 3 2
#4 3 2
#Правильный ответ
#2 3

a={1,3,2}
b={4,3,2}
print(a&b)