#2 ЛР
#Даны два целых числа. Выведите значение наименьшего из них.

x1=int(input('Введите первое число:'))
x2=int(input('Введите второе число:'))
if x1<x2:
    print('Наименьшее число:',x1)
else:
    print('Наименьшее число:', x2)
